[
  {
    "number": 1,
    "emoji": "💡",
    "title": "O que é Análise e Desenvolvimento de Sistemas?",
    "color": "blue",
    "commands": [
      {
        "cmd": "Definição",
        "desc": "É uma área fundamental da computação que envolve o estudo e aplicação de técnicas para projetar, implementar e manter sistemas de software. O profissional precisa compreender profundamente as necessidades do usuário ou da organização, traduzindo-as em soluções tecnológicas eficientes. Além disso, é responsável por acompanhar todo o ciclo de vida do sistema, desde sua concepção até sua manutenção, garantindo que a solução esteja sempre alinhada com os objetivos estratégicos do negócio."
      }
    ]
  },
  {
    "number": 2,
    "emoji": "📈",
    "title": "Etapas do Desenvolvimento de Sistemas",
    "color": "green",
    "commands": [
      {
        "cmd": "Levantamento de Requisitos",
        "desc": "Esta etapa busca identificar e documentar as necessidades do cliente, descrevendo funcionalidades que o sistema deverá oferecer. Técnicas comuns incluem entrevistas, questionários, brainstormings e observações no ambiente do usuário. Um levantamento eficaz evita retrabalho e garante que o produto final atenda às expectativas."
      },
      {
        "cmd": "Análise",
        "desc": "Na análise, os requisitos são organizados e refinados, utilizando modelos como diagramas de casos de uso e fluxogramas para visualizar o funcionamento do sistema. Essa etapa permite identificar possíveis problemas, dependências e validar que as soluções propostas são viáveis técnica e economicamente."
      },
      {
        "cmd": "Projeto (Design)",
        "desc": "O projeto define como o sistema será implementado, especificando sua arquitetura, tecnologias e padrões de codificação. Diagramas de classes, modelagem de banco de dados e protótipos de interface são criados para guiar a equipe de desenvolvimento, garantindo coesão e manutenibilidade."
      },
      {
        "cmd": "Implementação",
        "desc": "Consiste na programação propriamente dita, onde os desenvolvedores transformam os modelos criados em código executável. Além disso, são criadas rotinas de integração entre sistemas, migração de dados e scripts de automação, respeitando as melhores práticas de desenvolvimento seguro e eficiente."
      },
      {
        "cmd": "Testes",
        "desc": "Fundamental para assegurar a qualidade do software, os testes incluem desde a verificação de funcionalidades individuais (testes unitários), até o comportamento do sistema como um todo (testes de integração e aceitação). O objetivo é identificar e corrigir falhas antes da entrega ao cliente."
      },
      {
        "cmd": "Implantação",
        "desc": "A implantação envolve a disponibilização do sistema para o ambiente de produção. Inclui instalação, configuração, treinamento dos usuários e elaboração de materiais de apoio, como manuais e FAQs. É comum também planejar um rollback para eventuais problemas."
      },
      {
        "cmd": "Manutenção",
        "desc": "Após a entrega, a manutenção garante que o sistema continue eficiente e seguro. Pode envolver correção de bugs, otimização de desempenho, atualização de tecnologias e inclusão de novas funcionalidades conforme surgirem novas necessidades do negócio."
      }
    ]
  },
  {
    "number": 3,
    "emoji": "🧰",
    "title": "Principais Ferramentas Utilizadas",
    "color": "orange",
    "commands": [
      {
        "cmd": "IDE's",
        "desc": "Ambientes de Desenvolvimento Integrado como Visual Studio Code, IntelliJ IDEA e Eclipse proporcionam aos programadores recursos essenciais como depuração, autocompletar, controle de versão e execução de testes, acelerando o desenvolvimento e reduzindo erros."
      },
      {
        "cmd": "Modelagem",
        "desc": "Ferramentas como StarUML, Lucidchart e Draw.io auxiliam na criação de diagramas UML e fluxogramas, permitindo uma visão clara da estrutura e comportamento do sistema. Elas são indispensáveis para comunicar ideias de design entre membros da equipe."
      },
      {
        "cmd": "Controle de Versão",
        "desc": "Git, GitHub e GitLab permitem rastrear alterações no código-fonte, facilitar o trabalho colaborativo e garantir a integridade do projeto. São fundamentais para manter o histórico de desenvolvimento, criar ramificações (branches) e gerenciar versões."
      },
      {
        "cmd": "Bancos de Dados",
        "desc": "Sistemas de gerenciamento de banco de dados como MySQL, PostgreSQL e MongoDB são essenciais para o armazenamento e recuperação eficiente de dados. Cada um possui características específicas que se adequam a diferentes tipos de aplicações."
      }
    ]
  },
  {
    "number": 4,
    "emoji": "📊",
    "title": "Modelagem de Sistemas",
    "color": "purple",
    "commands": [
      {
        "cmd": "Diagrama de Casos de Uso",
        "desc": "Representa as funcionalidades que o sistema oferece (casos de uso) e os atores que interagem com ele, como usuários ou outros sistemas. É uma ferramenta útil para entender e comunicar os requisitos funcionais."
      },
      {
        "cmd": "Diagrama de Classes",
        "desc": "Modela as classes do sistema, seus atributos, métodos e relacionamentos. Auxilia na definição da estrutura do software e na identificação de padrões de projeto para reutilização e manutenibilidade do código."
      },
      {
        "cmd": "Diagrama de Sequência",
        "desc": "Mostra como os objetos do sistema interagem entre si ao longo do tempo, detalhando a troca de mensagens e a ordem de execução. É valioso para especificar o comportamento dinâmico e validar fluxos complexos."
      }
    ]
  },
  {
    "number": 5,
    "emoji": "🧑‍💻",
    "title": "Perfil do Profissional",
    "color": "teal",
    "commands": [
      {
        "cmd": "Habilidades Necessárias",
        "desc": "Além de sólida base técnica em programação, bancos de dados e engenharia de software, o profissional precisa ter raciocínio lógico, capacidade analítica e habilidades interpessoais. A comunicação eficaz é essencial para entender as demandas do cliente e trabalhar em equipe, enquanto a capacidade de resolver problemas garante a superação de desafios técnicos."
      }
    ]
  },
  {
    "number": 6,
    "emoji": "🔐",
    "title": "Segurança da Informação",
    "color": "red",
    "commands": [
      {
        "cmd": "Boas Práticas",
        "desc": "Implementar criptografia para proteger dados sensíveis, autenticação e autorização para controlar o acesso, backups periódicos para evitar perda de dados, além de medidas preventivas contra ataques como SQL Injection e Cross-Site Scripting (XSS). A segurança deve ser incorporada desde a concepção do sistema, evitando vulnerabilidades."
      }
    ]
  },
  {
    "number": 7,
    "emoji": "⚙️",
    "title": "Metodologias de Desenvolvimento",
    "color": "yellow",
    "commands": [
      {
        "cmd": "Cascata (Waterfall)",
        "desc": "Modelo tradicional em que cada fase do desenvolvimento é concluída antes do início da próxima. É indicado para projetos com requisitos bem definidos e baixa probabilidade de mudanças, proporcionando clareza no cronograma e orçamento."
      },
      {
        "cmd": "Scrum",
        "desc": "Metodologia ágil que divide o trabalho em ciclos curtos chamados sprints. Envolve reuniões diárias (daily meetings), revisões regulares e retrospectivas, permitindo ajustes rápidos e foco na entrega contínua de valor."
      },
      {
        "cmd": "Kanban",
        "desc": "Sistema visual de gerenciamento de tarefas que utiliza quadros e cartões para acompanhar o fluxo de trabalho. Ideal para ambientes com demandas variáveis e necessidade de flexibilidade, promovendo a melhoria contínua."
      }
    ]
  },
  {
    "number": 8,
    "emoji": "🌐",
    "title": "Desenvolvimento Web e Mobile",
    "color": "cyan",
    "commands": [
      {
        "cmd": "Web",
        "desc": "Envolve a criação de interfaces e funcionalidades para aplicações acessadas via navegadores. Tecnologias como HTML, CSS e JavaScript são a base, enquanto frameworks como React e Vue.js otimizam a produtividade e a manutenção do código."
      },
      {
        "cmd": "Back-end",
        "desc": "Responsável pela lógica de negócios, manipulação de dados e integração com outras aplicações. Linguagens como Node.js, PHP, Java e .NET são populares, e permitem construir APIs e serviços robustos e escaláveis."
      },
      {
        "cmd": "Mobile",
        "desc": "Desenvolvimento de aplicativos para dispositivos móveis. Pode ser nativo, usando linguagens específicas como Kotlin (Android) ou Swift (iOS), ou multiplataforma, com ferramentas como React Native e Flutter, que possibilitam criar apps para várias plataformas com um único código base."
      }
    ]
  },
  {
    "number": 9,
    "emoji": "🔍",
    "title": "Testes e Qualidade de Software",
    "color": "pink",
    "commands": [
      {
        "cmd": "Testes Unitários",
        "desc": "Focam na verificação de componentes ou funções isoladas do sistema. São essenciais para garantir que cada parte se comporte conforme o esperado e facilitam a manutenção futura."
      },
      {
        "cmd": "Testes de Integração",
        "desc": "Avaliam se diferentes módulos ou componentes do sistema funcionam corretamente em conjunto, identificando problemas de comunicação entre partes integradas."
      },
      {
        "cmd": "Testes de Aceitação",
        "desc": "Validados pelo cliente ou usuário final, asseguram que o sistema cumpre todos os requisitos especificados e está pronto para ser implantado."
      },
      {
        "cmd": "Testes de Usabilidade",
        "desc": "Analisam a experiência do usuário ao interagir com o sistema, verificando se é intuitivo, eficiente e agradável de utilizar."
      }
    ]
  },
  {
    "number": 10,
    "emoji": "📚",
    "title": "Recursos para aprender mais",
    "color": "gray",
    "commands": [
      {
        "cmd": "Livros",
        "desc": "Obras clássicas como 'Engenharia de Software' de Pressman, que aborda fundamentos e práticas modernas, e 'UML Distilled', um guia prático para modelagem de sistemas utilizando a linguagem UML."
      },
      {
        "cmd": "Cursos",
        "desc": "Plataformas como Udemy, Alura e Coursera oferecem cursos online atualizados sobre desenvolvimento de sistemas, abrangendo desde conceitos básicos até tópicos avançados."
      },
      {
        "cmd": "Documentações",
        "desc": "Consultas diretas às documentações oficiais das linguagens e frameworks são essenciais para aprofundar o conhecimento e seguir as melhores práticas de desenvolvimento."
      },
      {
        "cmd": "Comunidades",
        "desc": "Fóruns e redes como Stack Overflow, Dev.to e GitHub permitem trocar experiências, solucionar dúvidas e colaborar em projetos de código aberto, enriquecendo o aprendizado contínuo."
      }
    ]
  },
  {
    "number": 11,
    "emoji": "🚀",
    "title": "DevOps no Desenvolvimento de Sistemas",
    "color": "indigo",
    "commands": [
      {
        "cmd": "Principais Práticas",
        "desc": "Integração Contínua (CI) automatiza testes e builds a cada alteração no código; Entrega Contínua (CD) possibilita implantar atualizações rapidamente; Infraestrutura como Código (IaC) permite gerenciar recursos com scripts; Monitoramento e Logs garantem visibilidade e segurança; Automação reduz erros humanos e acelera processos."
      },
      {
        "cmd": "Ferramentas Populares",
        "desc": "Docker para conteinerização, Kubernetes para orquestração, Jenkins e GitHub Actions para pipelines CI/CD, além do Terraform para infraestrutura como código."
      }
    ]
  },
  {
    "number": 12,
    "emoji": "🎯",
    "title": "Caminhos de Carreira",
    "color": "blue",
    "commands": [
      {
        "cmd": "Possibilidades",
        "desc": "A trajetória profissional pode incluir funções técnicas como Desenvolvedor Front-end ou Back-end, Engenheiro de Software, Analista ou Arquiteto de Sistemas. Alternativamente, pode evoluir para posições de gestão como Product Owner, Scrum Master ou Gestor de Projetos. Áreas como Qualidade (QA) e DevOps também oferecem excelentes oportunidades."
      }
    ]
  },
  {
    "number": 13,
    "emoji": "📜",
    "title": "Certificações Relevantes",
    "color": "green",
    "commands": [
      {
        "cmd": "Metodologias Ágeis",
        "desc": "Certificações como Scrum Fundamentals, PSM (Professional Scrum Master) e CSPO (Certified Scrum Product Owner) validam conhecimento em práticas ágeis."
      },
      {
        "cmd": "Computação em Nuvem",
        "desc": "Certificação AWS Certified Developer comprova competência em desenvolvimento e implantação de aplicações na nuvem Amazon Web Services."
      },
      {
        "cmd": "Linguagens de Programação",
        "desc": "Oracle Java SE Programmer certifica profissionais na linguagem Java, atestando domínio de fundamentos e boas práticas."
      },
      {
        "cmd": "Cloud & DevOps",
        "desc": "Microsoft Azure Fundamentals oferece base sólida em serviços de computação em nuvem e DevOps, essencial para quem quer atuar neste segmento."
      },
      {
        "cmd": "Testes de Software",
        "desc": "ISTQB Foundation é uma certificação reconhecida internacionalmente para profissionais de qualidade e testes de software."
      },
      {
        "cmd": "Prática e Iniciação",
        "desc": "Programas como GitHub Octernship e Google Career Certificates auxiliam iniciantes a ingressar no mercado através de experiências práticas e networking."
      }
    ]
  },
  {
    "number": 14,
    "emoji": "🧪",
    "title": "Projetos Práticos Recomendados",
    "color": "purple",
    "commands": [
      {
        "cmd": "Ideias de Projetos",
        "desc": "Sistema de controle de estoque com login e gerenciamento de produtos, aplicativo de tarefas com CRUD e notificações, plataforma de cursos online com autenticação e pagamentos simulados, blog com painel administrativo e integração com APIs externas, além de um aplicativo de agenda pessoal sincronizado ao Google Calendar."
      },
      {
        "cmd": "Benefícios",
        "desc": "Ao realizar projetos práticos, você fixa o conhecimento, monta um portfólio atrativo, adquire experiência com versionamento de código (Git) e se prepara melhor para processos seletivos, incluindo entrevistas técnicas."
      }
    ]
  },
  {
    "number": 15,
    "emoji": "🧠",
    "title": "Habilidades Complementares",
    "color": "cyan",
    "commands": [
      {
        "cmd": "Soft Skills",
        "desc": "Comunicação eficaz, trabalho em equipe, pensamento lógico, gestão de tempo e resolução de problemas são habilidades essenciais que complementam o conhecimento técnico e melhoram o desempenho em ambientes colaborativos."
      },
      {
        "cmd": "Hard Skills Extra",
        "desc": "Noções de UX/UI para criação de interfaces mais intuitivas, conceitos de computação em nuvem para desenvolvimento moderno, automação de testes para garantir qualidade contínua e domínio de inglês técnico para leitura de documentações e interação com a comunidade global."
      }
    ]
  }
]
